zephray/Bric/fw/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t EPD_DC_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_1 (pin 2)  */
    GPIO_PinInit(BOARD_INITPINS_EPD_DC_GPIO, BOARD_INITPINS_EPD_DC_PORT, BOARD_INITPINS_EPD_DC_PIN, &EPD_DC_config);

    gpio_pin_config_t EPD_BUSY_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_2 (pin 52)  */
    GPIO_PinInit(BOARD_INITPINS_EPD_BUSY_GPIO, BOARD_INITPINS_EPD_BUSY_PORT, BOARD_INITPINS_EPD_BUSY_PIN, &EPD_BUSY_config);

    gpio_pin_config_t SW_PLUS_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_5 (pin 56)  */
    GPIO_PinInit(BOARD_INITPINS_SW_PLUS_GPIO, BOARD_INITPINS_SW_PLUS_PORT, BOARD_INITPINS_SW_PLUS_PIN, &SW_PLUS_config);

    gpio_pin_config_t LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin 13)  */
    GPIO_PinInit(BOARD_INITPINS_LED_GPIO, BOARD_INITPINS_LED_PORT, BOARD_INITPINS_LED_PIN, &LED_config);

    gpio_pin_config_t CODEC_RST_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_18 (pin 38)  */
    GPIO_PinInit(BOARD_INITPINS_CODEC_RST_GPIO, BOARD_INITPINS_CODEC_RST_PORT, BOARD_INITPINS_CODEC_RST_PIN, &CODEC_RST_config);

    gpio_pin_config_t SW_SEL_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_22 (pin 50)  */
    GPIO_PinInit(BOARD_INITPINS_SW_SEL_GPIO, BOARD_INITPINS_SW_SEL_PORT, BOARD_INITPINS_SW_SEL_PIN, &SW_SEL_config);

    gpio_pin_config_t USB_SUSPEND_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_26 (pin 40)  */
    GPIO_PinInit(BOARD_INITPINS_USB_SUSPEND_GPIO, BOARD_INITPINS_USB_SUSPEND_PORT, BOARD_INITPINS_USB_SUSPEND_PIN, &USB_SUSPEND_config);

    gpio_pin_config_t PMIC_ON_REQ_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_27 (pin 18)  */
    GPIO_PinInit(BOARD_INITPINS_PMIC_ON_REQ_GPIO, BOARD_INITPINS_PMIC_ON_REQ_PORT, BOARD_INITPINS_PMIC_ON_REQ_PIN, &PMIC_ON_REQ_config);

    gpio_pin_config_t SW_MIN_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin 59)  */
    GPIO_PinInit(BOARD_INITPINS_SW_MIN_GPIO, BOARD_INITPINS_SW_MIN_PORT, BOARD_INITPINS_SW_MIN_PIN, &SW_MIN_config);

    gpio_pin_config_t SW_BACK_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_30 (pin 60)  */
    GPIO_PinInit(BOARD_INITPINS_SW_BACK_GPIO, BOARD_INITPINS_SW_BACK_PORT, BOARD_INITPINS_SW_BACK_PIN, &SW_BACK_config);

    gpio_pin_config_t CHRG_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_2 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_CHRG_GPIO, BOARD_INITPINS_CHRG_PORT, BOARD_INITPINS_CHRG_PIN, &CHRG_config);

    gpio_pin_config_t PB_STAT_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_3 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_PB_STAT_GPIO, BOARD_INITPINS_PB_STAT_PORT, BOARD_INITPINS_PB_STAT_PIN, &PB_STAT_config);

    IOCON->PIO[0][1] = ((IOCON->PIO[0][1] &
                         /* Mask bits to zero which are setting */
                         (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                        /* Selects pin function.
                         * : PORT01 (pin 2) is configured as PIO0_1. */
                        | IOCON_PIO_FUNC(PIO0_1_FUNC_ALT0)

                        /* Select Digital mode.
                         * : Enable Digital mode.
                         * Digital input is enabled. */
                        | IOCON_PIO_DIGIMODE(PIO0_1_DIGIMODE_DIGITAL));

    IOCON->PIO[0][10] = ((IOCON->PIO[0][10] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT010 (pin 13) is configured as PIO0_10. */
                         | IOCON_PIO_FUNC(PIO0_10_FUNC_ALT0)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO0_10_DIGIMODE_DIGITAL));

    IOCON->PIO[0][11] = ((IOCON->PIO[0][11] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT011 (pin 6) is configured as SWCLK. */
                         | IOCON_PIO_FUNC(PIO0_11_FUNC_ALT6)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO0_11_DIGIMODE_DIGITAL));

    IOCON->PIO[0][12] = ((IOCON->PIO[0][12] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT012 (pin 5) is configured as SWDIO. */
                         | IOCON_PIO_FUNC(PIO0_12_FUNC_ALT6)

